app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at") VALUES (?, ?, ?)  [["caption", "I will not upload a pic"], ["created_at", "2017-10-08 04:58:20.808150"], ["updated_at", "2017-10-08 04:58:20.808150"]]
---
  def create
    @post = Post.create(post_params)